import type { RefObject } from 'react';
import Accordion from './Accordion'
import type { AccordionProps } from '@/shared/types/Accordion';
const deputiesSubmenu: string[] = [
  "قائم مقام رئیس دانشگاه",
  "معاونت توسعه و مدیریت منابع",
  "معاونت علوم، مهندسی و کشاورزی",
  "معاونت علوم انسانی و هنر",
  "معاونت علوم پزشکی",
  "معاونت علوم تربیتی و مهارتی دانشگاه",
  "معاونت فرهنگی و دانشجویی",
  "مرکز فرهنگی امام خمینی (ره) و انقلاب اسلامی",
  "مرکز حسابرسی هیات امنای دانشگاه",
  "اندیشکده مطالعات راهبردی",
  "دانشگاه هنرهای اسلامی ایرانی",
  "امور زنان و خانواده دانشگاه",
  "بسیج اساتید و دفتر هماهنگی کانون‌ها",
  "مرکز حوزه ریاست، روابط عمومی و هماهنگی امور استان‌ها",
  "معاونت امور مجلس و ارتباطات اجتماعی",
  "معاونت تحقیقات، فناوری و نوآوری",
  "معاونت بین‌الملل و امور دانشجویان غیرایرانی",
  "مرکز فناوری اطلاعات و شبکه علمی",
  "مرکز عمرانی، املاک و مستغلات",
  "مرکز نظارت، ارزیابی و رسیدگی به شکایات",
  "مرکز جذب و امور هیات علمی",
  "مرکز ورزش و تربیت بدنی",
  "مرکز گزینش",
  "مرکز امور شاهد و ایثارگران",
  "مرکز سنجش، پذیرش و فارغ‌التحصیلی",
  "مرکز امور حقوقی و صیانت از دارایی‌های دانشگاه",
  "مرکز مقاومت بسیج کارکنان",
  "مرکز امور هیات‌های ممیزه",
  "مرکز بین‌المللی آموزش زبان فارسی به غیر فارسی‌زبانان",
  "پژوهشگاه مرکزی دانشگاه آزاد اسلامی",
  "باشگاه پژوهشگران جوان و نخبگان",
  "مرکز حراست",
  "دفتر نهاد نمایندگی مقام معظم رهبری در دانشگاه",
  "صندوق پژوهش و فناوری",
  "آزمون EPT",
  "دفتر انتصابات دانشگاه",
];
const menuData: AccordionProps[] = [
  {
    id: "about",
    title: "آشنایی با دانشگاه",
    submenu: [
      "رئیس هیات امنا و هیات موسس",
      "ریاست دانشگاه",
      "تاریخچه دانشگاه",
      "اهداف و برنامه‌های دانشگاه",
      "ارکان دانشگاه",
      "نمودار سازمانی",
      "آرم دانشگاه",
    ],
  },
  {
    id: "deputies",
    title: "معاونت‌ها و مراکز",
    submenu: deputiesSubmenu,
  },
  {
    id: "news",
    title: "اخبار و رویدادها",
  },
  {
    id: "service",
    title: "میز خدمت",
  },
  {
    id: "media",
    title: "چند رسانه‌ای",
    submenu: ["گالری تصاویر", "ویدیوها"],
  },
  {
    id: "contact",
    title: "تماس با ما",
  },
];

interface Props<T extends HTMLElement = HTMLElement> {
   forwardRef: RefObject<T | null> 
   isOpen:boolean
}


function Navbar({forwardRef,isOpen}:Props) {
  return (
    <nav
        ref={forwardRef}
        className={`${isOpen ? "translate-0" : "translate-x-full"}  bg-primary-700/70 backdrop-blur-lg fixed top-0 right-0 bottom-0 z-50 w-full max-w-75/100 md:max-w-sm pt-16 transition-all duration-500`}
      >
        <Accordion items={menuData} />
      </nav>
  )
}

export default Navbar